OpenAtomFoundation/TobudOS/board/Nuvoton_M251/StdDriver/src/rtc.c
    /* Get [Time digit] data */
    g_u32HiHour = (RTC->TIME & RTC_TIME_TENHR_Msk) >> RTC_TIME_TENHR_Pos;
    g_u32LoHour = (RTC->TIME & RTC_TIME_HR_Msk) >> RTC_TIME_HR_Pos;
    g_u32HiMin  = (RTC->TIME & RTC_TIME_TENMIN_Msk) >> RTC_TIME_TENMIN_Pos;
    g_u32LoMin  = (RTC->TIME & RTC_TIME_MIN_Msk) >> RTC_TIME_MIN_Pos;
    g_u32HiSec  = (RTC->TIME & RTC_TIME_TENSEC_Msk) >> RTC_TIME_TENSEC_Pos;
    g_u32LoSec  = (RTC->TIME & RTC_TIME_SEC_Msk) >> RTC_TIME_SEC_Pos;

    /* Compute to 20XX year */
    u32Tmp  = (g_u32HiYear * 10ul);
    u32Tmp += g_u32LoYear;
    psPt->u32Year = u32Tmp + RTC_YEAR2000;

    /* Compute 0~12 month */
    u32Tmp = (g_u32HiMonth * 10ul);
    psPt->u32Month = u32Tmp + g_u32LoMonth;

    /* Compute 0~31 day */
    u32Tmp = (g_u32HiDay * 10ul);
    psPt->u32Day =  u32Tmp  + g_u32LoDay;

    /* Compute 12/24 hour */
    if (psPt->u32TimeScale == RTC_CLOCK_12)
    {
        u32Tmp = (g_u32HiHour * 10ul);
        u32Tmp += g_u32LoHour;
        psPt->u32Hour = u32Tmp;          /* AM: 1~12. PM: 21~32. */

        if (psPt->u32Hour >= 21ul)
        {
            psPt->u32AmPm  = RTC_PM;
            psPt->u32Hour -= 20ul;
        }
        else
        {
            psPt->u32AmPm = RTC_AM;
        }

        u32Tmp  = (g_u32HiMin  * 10ul);
        u32Tmp += g_u32LoMin;
        psPt->u32Minute = u32Tmp;

        u32Tmp  = (g_u32HiSec  * 10ul);
        u32Tmp += g_u32LoSec;
        psPt->u32Second = u32Tmp;
    }
    else
    {
        u32Tmp  = (g_u32HiHour * 10ul);
        u32Tmp += g_u32LoHour;
        psPt->u32Hour = u32Tmp;

        u32Tmp  = (g_u32HiMin * 10ul);
        u32Tmp +=  g_u32LoMin;
        psPt->u32Minute = u32Tmp;

        u32Tmp  = (g_u32HiSec * 10ul);
        u32Tmp += g_u32LoSec;
        psPt->u32Second = u32Tmp;
    }
}

/**
  * @brief      Get RTC Alarm Date and Time
  *
  * @param[out] psPt    The returned pointer is specified the RTC alarm value. It includes: \n
  *                     u32Year: Year value                                                 \n
  *                     u32Month: Month value                                               \n
  *                     u32Day: Day value                                                   \n
  *                     u32DayOfWeek: Day of week                                           \n
  *                     u32Hour: Hour value                                                 \n
  *                     u32Minute: Minute value                                             \n
  *                     u32Second: Second value                                             \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                         \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                           \n
  *
  * @return     None
  *
  * @details    This API is used to get the RTC alarm date and time setting.
  */
void RTC_GetAlarmDateAndTime(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32Tmp;

    psPt->u32TimeScale = RTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;     /* 12/24-hour */
    psPt->u32DayOfWeek = RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk; /* Day of the week */

    /* Get alarm [Date digit] data */
    g_u32HiYear  = (RTC->CALM & RTC_CALM_TENYEAR_Msk) >> RTC_CALM_TENYEAR_Pos;
    g_u32LoYear  = (RTC->CALM & RTC_CALM_YEAR_Msk) >> RTC_CALM_YEAR_Pos;
    g_u32HiMonth = (RTC->CALM & RTC_CALM_TENMON_Msk) >> RTC_CALM_TENMON_Pos;
    g_u32LoMonth = (RTC->CALM & RTC_CALM_MON_Msk) >> RTC_CALM_MON_Pos;
    g_u32HiDay   = (RTC->CALM & RTC_CALM_TENDAY_Msk) >> RTC_CALM_TENDAY_Pos;
    g_u32LoDay   = (RTC->CALM & RTC_CALM_DAY_Msk) >> RTC_CALM_DAY_Pos;

    /* Get alarm [Time digit] data */
    g_u32HiHour = (RTC->TALM & RTC_TALM_TENHR_Msk) >> RTC_TALM_TENHR_Pos;
    g_u32LoHour = (RTC->TALM & RTC_TALM_HR_Msk) >> RTC_TALM_HR_Pos;
    g_u32HiMin  = (RTC->TALM & RTC_TALM_TENMIN_Msk) >> RTC_TALM_TENMIN_Pos;
    g_u32LoMin  = (RTC->TALM & RTC_TALM_MIN_Msk) >> RTC_TALM_MIN_Pos;
    g_u32HiSec  = (RTC->TALM & RTC_TALM_TENSEC_Msk) >> RTC_TALM_TENSEC_Pos;
    g_u32LoSec  = (RTC->TALM & RTC_TALM_SEC_Msk) >> RTC_TALM_SEC_Pos;

    /* Compute to 20XX year */
    u32Tmp  = (g_u32HiYear * 10ul);
    u32Tmp += g_u32LoYear;
    psPt->u32Year = u32Tmp + RTC_YEAR2000;

    /* Compute 0~12 month */
    u32Tmp = (g_u32HiMonth * 10ul);
    psPt->u32Month = u32Tmp + g_u32LoMonth;

    /* Compute 0~31 day */
    u32Tmp = (g_u32HiDay * 10ul);
    psPt->u32Day = u32Tmp + g_u32LoDay;

    /* Compute 12/24 hour */
    if (psPt->u32TimeScale == RTC_CLOCK_12)
    {
        u32Tmp  = (g_u32HiHour * 10ul);
        u32Tmp += g_u32LoHour;
        psPt->u32Hour = u32Tmp;          /* AM: 1~12. PM: 21~32. */

        if (psPt->u32Hour >= 21ul)
        {
            psPt->u32AmPm  = RTC_PM;
            psPt->u32Hour -= 20ul;
        }
        else
        {
            psPt->u32AmPm = RTC_AM;
        }

        u32Tmp  = (g_u32HiMin * 10ul);
        u32Tmp += g_u32LoMin;
        psPt->u32Minute = u32Tmp;

        u32Tmp  = (g_u32HiSec * 10ul);
        u32Tmp += g_u32LoSec;
        psPt->u32Second = u32Tmp;

    }
    else
    {
        u32Tmp  = (g_u32HiHour * 10ul);
        u32Tmp +=  g_u32LoHour;
        psPt->u32Hour = u32Tmp;

        u32Tmp  = (g_u32HiMin * 10ul);
        u32Tmp += g_u32LoMin;
        psPt->u32Minute = u32Tmp;

        u32Tmp  = (g_u32HiSec * 10ul);
        u32Tmp += g_u32LoSec;
        psPt->u32Second = u32Tmp;
    }
}

/**
  * @brief      Update Current RTC Date and Time
  *
  * @param[in]  psPt    Specify the time property and current date and time. It includes:           \n
  *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
  *                     u32Month: Month value, range between 1 ~ 12.                                \n
  *                     u32Day: Day value, range between 1 ~ 31.                                    \n
  *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
  *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
  *                                                     RTC_SATURDAY]                               \n
  *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
  *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
  *                     u32Second: Second value, range between 0 ~ 59.                              \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
  *
  * @return     None
  *
  * @details    This API is used to update current date and time to RTC.
  */
void RTC_SetDateAndTime(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32RegCAL, u32RegTIME;

